CSI API ETABS v1

# cGenDisplDeletePoint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int DeletePoint(
    	string Name,
    	string PointName
    )

    Function DeletePoint (
    	Name As String,
    	PointName As String
    ) As Integer

    Dim instance As cGenDispl
    Dim Name As String
    Dim PointName As String
    Dim returnValue As Integer

    returnValue = instance.DeletePoint(Name,
    	PointName)

    int DeletePoint(
    	String^ Name,
    	String^ PointName
    )

    abstract DeletePoint :
            Name : string *
            PointName : string -> int

#### Parameters

Name

    Type: SystemString

PointName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cGenDispl Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com